In [1]:
import numpy as np
import pandas as pd
from datetime import datetime

In [2]:
year = 2021
month = 8
day = 18
hour = 4
min = 8

In [3]:
datetime(year , month , day , hour , min)

datetime.datetime(2021, 8, 18, 4, 8)

In [4]:
# more information can be added such as second & microseconds
sec= 56
msec = 5
recorded_time = datetime(year , month , day , hour , min, sec ,msec)

In [5]:
recorded_time

datetime.datetime(2021, 8, 18, 4, 8, 56, 5)

In [6]:
recorded_time.year

2021

In [7]:
recorded_time.day

18

In [8]:
data = pd.Series(['Nov ,13 ,1995', '2010,05,06',None])

In [9]:
data

0    Nov ,13 ,1995
1       2010,05,06
2             None
dtype: object

In [10]:
pd.to_datetime(data)

0   1995-11-13
1   2010-06-01
2          NaT
dtype: datetime64[ns]

In [11]:
I = pd.to_datetime(data)

In [12]:
I

0   1995-11-13
1   2010-06-01
2          NaT
dtype: datetime64[ns]

In [13]:
I[1].year

2010

In [14]:
# Note : there is difference in europ date format & American date format 
# the date format used in Pandas is the Amercain , but it can be modified to Europian format

In [15]:
euro_time = '10-12-2015'

In [16]:
pd.to_datetime(euro_time)

Timestamp('2015-10-12 00:00:00')

In [17]:
# it considered (10) as the month !!! So to correct it
pd.to_datetime(euro_time, dayfirst=True)

Timestamp('2015-12-10 00:00:00')

In [18]:
# the date formate may available in different ways such as 
N = '18--Dec--1988'

In [19]:
pd.to_datetime(N,format='%d--%b--%Y')

Timestamp('1988-12-18 00:00:00')

In [20]:
# This letters samples is available on net

In [21]:
K = '15th of Nov 1989'

In [22]:
pd.to_datetime(K)

Timestamp('1989-11-15 00:00:00')

In [23]:
A = pd.read_csv('RetailSales_BeerWineLiquor.csv')

In [24]:
A.head()

         DATE  MRTSSM4453USN
0  1992-01-01           1509
1  1992-02-01           1541
2  1992-03-01           1597
3  1992-04-01           1675
4  1992-05-01           1822

In [25]:
A.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 340 entries, 0 to 339
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   DATE           340 non-null    object
 1   MRTSSM4453USN  340 non-null    int64
dtypes: int64(1), object(1)
memory usage: 5.4+ KB

In [26]:
A['DATE']

0      1992-01-01
1      1992-02-01
2      1992-03-01
3      1992-04-01
4      1992-05-01
          ...
335    2019-12-01
336    2020-01-01
337    2020-02-01
338    2020-03-01
339    2020-04-01
Name: DATE, Length: 340, dtype: object

In [27]:
# the column type is object !! then a command like below will not work
A['DATE'][0].year

AttributeError: 'str' object has no attribute 'year'

In [29]:
A['DATE'] =pd.to_datetime(A['DATE'])

In [30]:
A['DATE']

0     1992-01-01
1     1992-02-01
2     1992-03-01
3     1992-04-01
4     1992-05-01
         ...
335   2019-12-01
336   2020-01-01
337   2020-02-01
338   2020-03-01
339   2020-04-01
Name: DATE, Length: 340, dtype: datetime64[ns]

In [31]:
A['DATE'][0].year

1992

In [32]:
# It possible to use dt 
A['DATE'].dt.year

0      1992
1      1992
2      1992
3      1992
4      1992
       ...
335    2019
336    2020
337    2020
338    2020
339    2020
Name: DATE, Length: 340, dtype: int64

In [33]:
# There is another way to directly read the data and to consider it at datetime

In [34]:
B = pd.read_csv('RetailSales_BeerWineLiquor.csv', parse_dates=[0])

In [35]:
B['DATE']

0     1992-01-01
1     1992-02-01
2     1992-03-01
3     1992-04-01
4     1992-05-01
         ...
335   2019-12-01
336   2020-01-01
337   2020-02-01
338   2020-03-01
339   2020-04-01
Name: DATE, Length: 340, dtype: datetime64[ns]

In [36]:
# The type of column is datetime !!

In [37]:
# To make the DATE column as index
D = pd.read_csv('RetailSales_BeerWineLiquor.csv', parse_dates=[0], index_col='DATE')

In [38]:
D

            MRTSSM4453USN
DATE
1992-01-01           1509
1992-02-01           1541
1992-03-01           1597
1992-04-01           1675
1992-05-01           1822
...                   ...
2019-12-01           6630
2020-01-01           4388
2020-02-01           4533
2020-03-01           5562
2020-04-01           5207

[340 rows x 1 columns]

In [39]:
# To get avarage values of saling per year 
D.resample(rule='A').mean()

            MRTSSM4453USN
DATE
1992-12-31    1807.250000
1993-12-31    1794.833333
1994-12-31    1841.750000
1995-12-31    1833.916667
1996-12-31    1929.750000
1997-12-31    2006.750000
1998-12-31    2115.166667
1999-12-31    2206.333333
2000-12-31    2375.583333
2001-12-31    2468.416667
2002-12-31    2491.166667
2003-12-31    2539.083333
2004-12-31    2682.416667
2005-12-31    2797.250000
2006-12-31    3001.333333
2007-12-31    3177.333333
2008-12-31    3292.000000
2009-12-31    3353.750000
2010-12-31    3450.083333
2011-12-31    3532.666667
2012-12-31    3697.083333
2013-12-31    3839.666667
2014-12-31    4023.833333
2015-12-31    4212.500000
2016-12-31    4434.416667
2017-12-31    4602.666667
2018-12-31    4830.666667
2019-12-31    4972.750000
2020-12-31    4922.500000

In [40]:
# To get sum values of saling per year 

D.resample(rule='A').sum()

            MRTSSM4453USN
DATE
1992-12-31          21687
1993-12-31          21538
1994-12-31          22101
1995-12-31          22007
1996-12-31          23157
1997-12-31          24081
1998-12-31          25382
1999-12-31          26476
2000-12-31          28507
2001-12-31          29621
2002-12-31          29894
2003-12-31          30469
2004-12-31          32189
2005-12-31          33567
2006-12-31          36016
2007-12-31          38128
2008-12-31          39504
2009-12-31          40245
2010-12-31          41401
2011-12-31          42392
2012-12-31          44365
2013-12-31          46076
2014-12-31          48286
2015-12-31          50550
2016-12-31          53213
2017-12-31          55232
2018-12-31          57968
2019-12-31          59673
2020-12-31          19690

# Ganerate Datetime

In [41]:
pd.date_range(start='1-1-1991',periods=340, freq='MS')

DatetimeIndex(['1991-01-01', '1991-02-01', '1991-03-01', '1991-04-01',
               '1991-05-01', '1991-06-01', '1991-07-01', '1991-08-01',
               '1991-09-01', '1991-10-01',
               ...
               '2018-07-01', '2018-08-01', '2018-09-01', '2018-10-01',
               '2018-11-01', '2018-12-01', '2019-01-01', '2019-02-01',
               '2019-03-01', '2019-04-01'],
              dtype='datetime64[ns]', length=340, freq='MS')

In [42]:
rang =pd.date_range(start='1-Jul-2019',periods=70, freq='B')

In [43]:
rang

DatetimeIndex(['2019-07-01', '2019-07-02', '2019-07-03', '2019-07-04',
               '2019-07-05', '2019-07-08', '2019-07-09', '2019-07-10',
               '2019-07-11', '2019-07-12', '2019-07-15', '2019-07-16',
               '2019-07-17', '2019-07-18', '2019-07-19', '2019-07-22',
               '2019-07-23', '2019-07-24', '2019-07-25', '2019-07-26',
               '2019-07-29', '2019-07-30', '2019-07-31', '2019-08-01',
               '2019-08-02', '2019-08-05', '2019-08-06', '2019-08-07',
               '2019-08-08', '2019-08-09', '2019-08-12', '2019-08-13',
               '2019-08-14', '2019-08-15', '2019-08-16', '2019-08-19',
               '2019-08-20', '2019-08-21', '2019-08-22', '2019-08-23',
               '2019-08-26', '2019-08-27', '2019-08-28', '2019-08-29',
               '2019-08-30', '2019-09-02', '2019-09-03', '2019-09-04',
               '2019-09-05', '2019-09-06', '2019-09-09', '2019-09-10',
               '2019-09-11', '2019-09-12', '2019-09-13', '2019-09-16',
               '2019-09-17', '2019-09-18', '2019-09-19', '2019-09-20',
               '2019-09-23', '2019-09-24', '2019-09-25', '2019-09-26',
               '2019-09-27', '2019-09-30', '2019-10-01', '2019-10-02',
               '2019-10-03', '2019-10-04'],
              dtype='datetime64[ns]', freq='B')

In [44]:
len(rang)

70

In [45]:
crang = rang.copy()

In [46]:
from pandas.tseries.offsets import CustomBusinessDay

In [47]:
hday = CustomBusinessDay(holidays=['2019-07-04'])
# possible to change the week end according to target country 
# hday = CustomBusinessDay(holidays=['2019-07-04'], weekmask='Sun Mon Tue Wed Thu')

In [48]:
rang =pd.date_range(start='1-Jul-2019',periods=70, freq=hday)

In [49]:
rang

DatetimeIndex(['2019-07-01', '2019-07-02', '2019-07-03', '2019-07-05',
               '2019-07-08', '2019-07-09', '2019-07-10', '2019-07-11',
               '2019-07-12', '2019-07-15', '2019-07-16', '2019-07-17',
               '2019-07-18', '2019-07-19', '2019-07-22', '2019-07-23',
               '2019-07-24', '2019-07-25', '2019-07-26', '2019-07-29',
               '2019-07-30', '2019-07-31', '2019-08-01', '2019-08-02',
               '2019-08-05', '2019-08-06', '2019-08-07', '2019-08-08',
               '2019-08-09', '2019-08-12', '2019-08-13', '2019-08-14',
               '2019-08-15', '2019-08-16', '2019-08-19', '2019-08-20',
               '2019-08-21', '2019-08-22', '2019-08-23', '2019-08-26',
               '2019-08-27', '2019-08-28', '2019-08-29', '2019-08-30',
               '2019-09-02', '2019-09-03', '2019-09-04', '2019-09-05',
               '2019-09-06', '2019-09-09', '2019-09-10', '2019-09-11',
               '2019-09-12', '2019-09-13', '2019-09-16', '2019-09-17',
               '2019-09-18', '2019-09-19', '2019-09-20', '2019-09-23',
               '2019-09-24', '2019-09-25', '2019-09-26', '2019-09-27',
               '2019-09-30', '2019-10-01', '2019-10-02', '2019-10-03',
               '2019-10-04', '2019-10-07'],
              dtype='datetime64[ns]', freq='C')

In [50]:
# Other way to do it 
from pandas.tseries.holiday import USFederalHolidayCalendar

In [51]:
hday2 = CustomBusinessDay(calendar=USFederalHolidayCalendar())

In [52]:
crang

DatetimeIndex(['2019-07-01', '2019-07-02', '2019-07-03', '2019-07-04',
               '2019-07-05', '2019-07-08', '2019-07-09', '2019-07-10',
               '2019-07-11', '2019-07-12', '2019-07-15', '2019-07-16',
               '2019-07-17', '2019-07-18', '2019-07-19', '2019-07-22',
               '2019-07-23', '2019-07-24', '2019-07-25', '2019-07-26',
               '2019-07-29', '2019-07-30', '2019-07-31', '2019-08-01',
               '2019-08-02', '2019-08-05', '2019-08-06', '2019-08-07',
               '2019-08-08', '2019-08-09', '2019-08-12', '2019-08-13',
               '2019-08-14', '2019-08-15', '2019-08-16', '2019-08-19',
               '2019-08-20', '2019-08-21', '2019-08-22', '2019-08-23',
               '2019-08-26', '2019-08-27', '2019-08-28', '2019-08-29',
               '2019-08-30', '2019-09-02', '2019-09-03', '2019-09-04',
               '2019-09-05', '2019-09-06', '2019-09-09', '2019-09-10',
               '2019-09-11', '2019-09-12', '2019-09-13', '2019-09-16',
               '2019-09-17', '2019-09-18', '2019-09-19', '2019-09-20',
               '2019-09-23', '2019-09-24', '2019-09-25', '2019-09-26',
               '2019-09-27', '2019-09-30', '2019-10-01', '2019-10-02',
               '2019-10-03', '2019-10-04'],
              dtype='datetime64[ns]', freq='B')

In [53]:
crang =pd.date_range(start='1-Jul-2019',periods=70, freq=hday2)

In [54]:
crang

DatetimeIndex(['2019-07-01', '2019-07-02', '2019-07-03', '2019-07-05',
               '2019-07-08', '2019-07-09', '2019-07-10', '2019-07-11',
               '2019-07-12', '2019-07-15', '2019-07-16', '2019-07-17',
               '2019-07-18', '2019-07-19', '2019-07-22', '2019-07-23',
               '2019-07-24', '2019-07-25', '2019-07-26', '2019-07-29',
               '2019-07-30', '2019-07-31', '2019-08-01', '2019-08-02',
               '2019-08-05', '2019-08-06', '2019-08-07', '2019-08-08',
               '2019-08-09', '2019-08-12', '2019-08-13', '2019-08-14',
               '2019-08-15', '2019-08-16', '2019-08-19', '2019-08-20',
               '2019-08-21', '2019-08-22', '2019-08-23', '2019-08-26',
               '2019-08-27', '2019-08-28', '2019-08-29', '2019-08-30',
               '2019-09-03', '2019-09-04', '2019-09-05', '2019-09-06',
               '2019-09-09', '2019-09-10', '2019-09-11', '2019-09-12',
               '2019-09-13', '2019-09-16', '2019-09-17', '2019-09-18',
               '2019-09-19', '2019-09-20', '2019-09-23', '2019-09-24',
               '2019-09-25', '2019-09-26', '2019-09-27', '2019-09-30',
               '2019-10-01', '2019-10-02', '2019-10-03', '2019-10-04',
               '2019-10-07', '2019-10-08'],
              dtype='datetime64[ns]', freq='C')

In [55]:
# now will delet the column 'DATE' and generate it again 
D = D.reset_index()

In [56]:
D

          DATE  MRTSSM4453USN
0   1992-01-01           1509
1   1992-02-01           1541
2   1992-03-01           1597
3   1992-04-01           1675
4   1992-05-01           1822
..         ...            ...
335 2019-12-01           6630
336 2020-01-01           4388
337 2020-02-01           4533
338 2020-03-01           5562
339 2020-04-01           5207

[340 rows x 2 columns]

In [57]:
D= D.drop('DATE',axis=1)

In [58]:
D

     MRTSSM4453USN
0             1509
1             1541
2             1597
3             1675
4             1822
..             ...
335           6630
336           4388
337           4533
338           5562
339           5207

[340 rows x 1 columns]

In [59]:
D['date']= pd.date_range(start='1-1-1991',periods=340, freq='MS')

In [60]:
D

     MRTSSM4453USN       date
0             1509 1991-01-01
1             1541 1991-02-01
2             1597 1991-03-01
3             1675 1991-04-01
4             1822 1991-05-01
..             ...        ...
335           6630 2018-12-01
336           4388 2019-01-01
337           4533 2019-02-01
338           5562 2019-03-01
339           5207 2019-04-01

[340 rows x 2 columns]

In [61]:
D = D.set_index('date')

In [62]:
D

            MRTSSM4453USN
date
1991-01-01           1509
1991-02-01           1541
1991-03-01           1597
1991-04-01           1675
1991-05-01           1822
...                   ...
2018-12-01           6630
2019-01-01           4388
2019-02-01           4533
2019-03-01           5562
2019-04-01           5207

[340 rows x 1 columns]